<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"f21741918e288503f3c3dca0a76ca27ee414f0ce06a1e09a6a62c2720dff9409","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #593 at https://github.com/cal-itp/data-infra/actions/runs/17627666717","plan_out_hash":"69a55043cefd4bbc9731b2e0f1c19fdf64cb4f6b11241545afa02d6479c16eb0","plan_hash":"26360486fd07a9e8cf0e8eb774ad245ea9a5170a6a1a21a846b2a58ad504f09c","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 7 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "FlODKQ==" -> (known after apply)
!~      detect_md5hash      = "1pXuSms2Y9YNBXKuHndEIQ==" -> "different hash"
!~      generation          = 1757464205727281 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_and_validate_rt.py"
!~      md5hash             = "1pXuSms2Y9YNBXKuHndEIQ==" -> (known after apply)
        name                = "dags/parse_and_validate_rt.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "9Bqr4w==" -> (known after apply)
!~      detect_md5hash      = "mInadWRDWjh+tokFz6gkng==" -> "different hash"
!~      generation          = 1757464206568623 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "mInadWRDWjh+tokFz6gkng==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/transit_database/dimensions/int_transit_database__gtfs_datasets_dim.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "4f1s3w==" -> (known after apply)
!~      detect_md5hash      = "IGkuSAy/G11WON5BKC761Q==" -> "different hash"
!~      generation          = 1749663114080976 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/intermediate/transit_database/dimensions/int_transit_database__gtfs_datasets_dim.sql"
!~      md5hash             = "IGkuSAy/G11WON5BKC761Q==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/transit_database/dimensions/int_transit_database__gtfs_datasets_dim.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/transit_database/_mart_transit_database.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "b8nOEw==" -> (known after apply)
!~      detect_md5hash      = "6xSVbYLmRIFEpaQwPKZw7w==" -> "different hash"
!~      generation          = 1752627599326367 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/transit_database/_mart_transit_database.yml"
!~      md5hash             = "6xSVbYLmRIFEpaQwPKZw7w==" -> (known after apply)
        name                = "data/warehouse/models/mart/transit_database/_mart_transit_database.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/transit_database/dim_gtfs_datasets.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "iZj0CQ==" -> (known after apply)
!~      detect_md5hash      = "UCjs69xwq3UGgsaOM8eKTg==" -> "different hash"
!~      generation          = 1749663112718886 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/transit_database/dim_gtfs_datasets.sql"
!~      md5hash             = "UCjs69xwq3UGgsaOM8eKTg==" -> (known after apply)
        name                = "data/warehouse/models/mart/transit_database/dim_gtfs_datasets.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/transit_database/stg_transit_database__gtfs_datasets.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "kuuaEQ==" -> (known after apply)
!~      detect_md5hash      = "tPp55852vH6MEWCf4KHKHA==" -> "different hash"
!~      generation          = 1749663116130730 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/transit_database/stg_transit_database__gtfs_datasets.sql"
!~      md5hash             = "tPp55852vH6MEWCf4KHKHA==" -> (known after apply)
        name                = "data/warehouse/models/staging/transit_database/stg_transit_database__gtfs_datasets.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "0a690w==" -> (known after apply)
!~      detect_md5hash      = "IUyhnmVFziGZDy/h4Z5Gzw==" -> "different hash"
!~      generation          = 1757464208416781 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "IUyhnmVFziGZDy/h4Z5Gzw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 7 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #593](https://github.com/cal-itp/data-infra/actions/runs/17627666717)